{"id":"upmhtkckri","title":"Use Milvus Vector DB for Multi-Vector-Multi-Modal Hybrid Search","documentationURL":"https://ibm.box.com/s/efzyyllwa1olta4bxd4pe6wg3bfxfwtn","author":"Bharathi Chaudhury, Partha Pratim Neog","categoryId":2,"description":"The query_milvus_multimodal function performs a multimodal, multi-vector search in a Milvus database. It combines embeddings from both text and image data, enabling hybrid searches based on a user-provided query. The function uses embeddings generated by models e5-large for text descriptions and CLIP for both text and images. It ranks search results based on custom weights for each modality, offering a highly flexible and accurate retrieval process for images and product descriptions.\nFunction: query_milvus_multimodal\nParameters\n\n    query: (str) The input text for search queries.\n    sub_product_group: (str) The specific subcategory of products to narrow down search results. Example: \"Armchair\", \"Beds\".\n    num_results: (int) The number of results to return.\n    img_weight: (float, optional) Weight applied to image similarity during search ranking. Default is 0.2.\n    desc_weight: (float, optional) Weight applied to description similarity during search ranking. Default is 0.1.\n    generated_query_weight: (float, optional) Weight for generated query similarity during search ranking. Default is 0.7.\n    milvus_creds:(dictionary) Milvus credentials with host, port and password\n\nSteps and Logic\n\n    Category Mapping: The function defines a mapping between sub_product_group categories, allowing the search to be expanded to related categories. This helps in including broader or similar product types in the search.\n\n    Query Expression: Based on the sub_product_group, an expression is generated to filter search results. If a subcategory is defined, the function ensures it's matched with related categories using the predefined mappings.\n\n    Embedding Generation:\n        Text Embeddings (e5-large): The user query is transformed into embeddings using the e5-large model.\n        Text Embeddings (CLIP): Another set of embeddings is created using CLIP for matching the query against images and text.\n\n    Search Requests: The function constructs multiple search requests using the embeddings:\n        e5-large embeddings for searching product descriptions.\n        CLIP embeddings for matching both product descriptions and images.\n\n    Hybrid Search Execution: A weighted hybrid search is performed, combining multiple search requests using a weighted ranking system based on the provided weights (img_weight, desc_weight, generated_query_weight). The search results are then returned, including fields like ArticleColorId, GeneratedQueries, and ProductDisplayDescription.\n\nReturn Value\n\n    The function returns a ranked list of search results (hybrid_res), combining image, description, and generated query similarity according to the provided weights.","typeId":1,"type":"python","fileName":"upmhtkckri.py","source":"local","assetURL":"","userId":"393bd77f-9fb6-4448-a41b-4de228dfb0b9","preRequisites":{"fields":[{"type":"text","label":"milvus_creds"},{"type":"text","label":"query"},{"type":"text","label":"sub_product_group"},{"type":"text","label":"num_results"}],"requiredFields":[["milvus_creds","query","sub_product_group","num_results"]],"installDependencyCommands":["pymilvus==2.4.5"," sentence-transformers==3.0.1"]},"createdTimestamp":1727241164256,"updatedTimestamp":1727241164256}